{
    "projects_sectionTitle": "Proyectos",
    "projects_codeButton": "Código",
    "projects_culturefit_title": "CultureFit - Gestión de Gimnasio",
    "projects_culturefit_description": "Una plataforma de gestión de gimnasios con suscripciones, contenido online y programación de citas.",
    "projects_smartsphere_title": "SmartSphere - Tienda tecnológica y gestión administrativa",
    "projects_smartsphere_description": "Una plataforma de comercio electrónico para productos tecnológicos, con listado de productos, funcionalidad de carrito y pago seguro.",
    "projects_trivial_title": "Juego Trivial de cultura",
    "projects_trivial_description": "Un juego en la terminal de Python, con preguntas y respuestas. Es un proyecto con conceptos de POO y JSON para guardar las preguntas.",
    "projects_vue_title": "Shop - Gestor de Tareas",
    "projects_vue_description": "Un gestor de tareas con autenticación de usuario, creación de tareas, carrito, etc.",
    "projects_dao_title": "Hogwarts - Acceso a BD",
    "projects_dao_description": "Un pequeño proyecto para acceder a una BD con estudiantes y casas de Hogwarts.",
    "projects_details_previous": "Anterior",
    "projects_details_next": "Siguiente",
    "projects_details_imageAlt": "Captura de pantalla {{number}} de {{title}}",
    "projects_details_imageIndicatorAlt": "Imagen {{number}}",
    "projects_details_liveDemo": "Demo en Vivo",
    "projects_details_viewCode": "Ver Código",
    "projects_details_dateLabel": "Fecha",
    "projects_details_roleLabel": "Rol",
    "projects_details_technologiesLabel": "Tecnologías",
    "projects_details_tabOverview": "Resumen",
    "projects_details_tabFeatures": "Características",
    "projects_details_tabChallenges": "Retos y Soluciones",
    "projects_details_featuresTitle": "Características Clave",
    "projects_details_challengesTitle": "Retos",
    "projects_details_solutionsTitle": "Soluciones",
    "projects_status_ongoing": "En curso",
    "projects_culturefit_role": "Desarrollador Backend, Gestor de Proyecto, Especialista en Optimización",
    "projects_culturefit_longDescription": "Esta aplicación fue desarrollada por un equipo de tres, con cada miembro centrándose en diferentes características. Mis contribuciones principales fueron el desarrollo del backend, la gestión de tareas, la optimización de la aplicación y algunos componentes frontend. La plataforma está diseñada para la gestión de gimnasios, ofreciendo características clave como suscripciones, contenido online, programación de citas y más. Construida con Spring Boot, React, MySQL y Docker, la aplicación todavía está en desarrollo pero ya tiene una parte sustancial de su funcionalidad principal implementada.",
    "projects_culturefit_challenges": "Gestionar diferentes planes de suscripción con acceso restringido, asegurar la distribución segura de contenido online y sincronizar el sistema de citas con la disponibilidad profesional.",
    "projects_culturefit_solutions": "Se implementó control de acceso basado en JWT para restricciones basadas en roles, se aseguró el contenido online con protección de streaming y se construyó un sistema de programación basado en eventos para prevenir reservas duplicadas.",
    "projects_culturefit_feature_1": "Autenticación de usuario",
    "projects_culturefit_feature_2": "Gestión de suscripciones",
    "projects_culturefit_feature_3": "Programación de citas",
    "projects_culturefit_feature_4": "Contenido online",
    "projects_culturefit_feature_5": "Roles",
    "projects_culturefit_features_count": 5,
    "projects_smartsphere_role": "Desarrollador Frontend",
    "projects_smartsphere_longDescription": "Esta aplicación fue desarrollada por Johan Fernando Aponte Valencia. Es una tienda online especializada en productos tecnológicos, que ofrece una experiencia de compra completa. La plataforma incluye funcionalidades esenciales de comercio electrónico como listado de productos, carrito de compras, pago seguro y un panel de administración para gestionar usuarios y productos. La aplicación está construida con React y Tailwind CSS y continúa desarrollándose activamente.",
    "projects_smartsphere_challenges": "Asegurar la funcionalidad persistente del carrito y mantener la gestión de inventario en tiempo real.",
    "projects_smartsphere_solutions": "Se implementó JSON-SERVER para persistir los datos del carrito y se desarrolló un sistema de control de stock que bloquea los artículos en el carrito hasta que se completa el pago.",
    "projects_smartsphere_feature_1": "Autenticación de usuario",
    "projects_smartsphere_feature_2": "Listado de productos",
    "projects_smartsphere_feature_3": "Funcionalidad de carrito",
    "projects_smartsphere_feature_4": "Pago seguro",
    "projects_smartsphere_feature_5": "Panel de administración",
    "projects_smartsphere_features_count": 5,
    "projects_trivial_role": "Desarrollador Backend",
    "projects_trivial_longDescription": "Este proyecto es un juego de trivial basado en terminal desarrollado en Python. Aprovecha los principios de la Programación Orientada a Objetos (POO) para gestionar la lógica del juego y utiliza JSON para almacenar y recuperar preguntas y respuestas. El juego proporciona una forma atractiva de probar conocimientos culturales con una variedad de preguntas.",
    "projects_trivial_challenges": "Diseñar un sistema flexible de almacenamiento de preguntas y asegurar una interacción fluida del usuario en un entorno basado en terminal.",
    "projects_trivial_solutions": "Se implementó un sistema de almacenamiento basado en JSON para facilitar la gestión de preguntas y se utilizaron las características de POO de Python para crear una base de código modular y mantenible.",
    "projects_trivial_feature_1": "Funcionalidad de preguntas y respuestas",
    "projects_trivial_feature_2": "Seguimiento de puntuación",
    "projects_trivial_feature_3": "Almacenamiento de preguntas basado en JSON",
    "projects_trivial_feature_4": "Diseño POO para escalabilidad",
    "projects_trivial_features_count": 4,
    "projects_vue_role": "Desarrollador Full Stack",
    "projects_vue_longDescription": "Este proyecto es una aplicación de gestión de tareas desarrollada usando Vue.js para el frontend y Express para el backend. Incluye características como autenticación de usuario, creación de tareas y un carrito de compras. Se utiliza MongoDB para el almacenamiento de datos y Bootstrap para el estilo. La aplicación demuestra una implementación full-stack con un enfoque en la usabilidad y escalabilidad.",
    "projects_vue_challenges": "Integrar la gestión del estado con Pinia y asegurar una comunicación fluida entre el frontend y el backend.",
    "projects_vue_solutions": "Se utilizó Pinia para una gestión eficiente del estado y se implementaron API RESTful con Express para manejar las operaciones del backend.",
    "projects_vue_feature_1": "Autenticación de usuario",
    "projects_vue_feature_2": "Creación y gestión de tareas",
    "projects_vue_feature_3": "Funcionalidad de carrito de compras",
    "projects_vue_feature_4": "Diseño responsive",
    "projects_vue_features_count": 4,
    "projects_dao_role": "Desarrollador Backend",
    "projects_dao_longDescription": "Este proyecto es una aplicación de acceso a base de datos desarrollada en Java. Permite a los usuarios interactuar con una base de datos que contiene información sobre estudiantes y casas del universo de Harry Potter. El proyecto demuestra el uso de Java para el desarrollo backend y MySQL para la gestión de bases de datos.",
    "projects_dao_challenges": "Diseñar un esquema de base de datos eficiente y asegurar una interacción fluida entre la aplicación Java y la base de datos MySQL.",
    "projects_dao_solutions": "Se implementó un esquema de base de datos normalizado y se utilizó JDBC para una comunicación fluida entre la aplicación y la base de datos.",
    "projects_dao_feature_1": "Acceso a base de datos",
    "projects_dao_feature_2": "Operaciones CRUD",
    "projects_dao_feature_3": "Gestión de estudiantes y casas",
    "projects_dao_features_count": 3
}