{
    "projects_sectionTitle": "Projects",
    "projects_codeButton": "Code",
    "projects_culturefit_title": "CultureFit - Gym Management",
    "projects_culturefit_description": "A gym management platform with subscriptions, online content, and appointment scheduling.",
    "projects_smartsphere_title": "SmartSphere - Technology shop and admin management",
    "projects_smartsphere_description": "An e-commerce platform for technology products, featuring product listings, cart functionality, and secure checkout.",
    "projects_trivial_title": "Trivia culture game",
    "projects_vue_title": "Shop - Task Manager",
    "projects_vue_description": "A task manager with user authentication, task creation, cart etc.",
    "projects_dao_title": "Hogwarts - DB access",
    "projects_dao_description": "A little project to access a DB with students and houses of Hogwarts.",
    "projects_details_previous": "Previous",
    "projects_details_next": "Next",
    "projects_details_imageAlt": "{{title}} screenshot {{number}}",
    "projects_details_imageIndicatorAlt": "Image {{number}}",
    "projects_details_liveDemo": "Live Demo",
    "projects_details_viewCode": "View Code",
    "projects_details_dateLabel": "Date",
    "projects_details_roleLabel": "Role",
    "projects_details_technologiesLabel": "Technologies",
    "projects_details_tabOverview": "Overview",
    "projects_details_tabFeatures": "Features",
    "projects_details_tabChallenges": "Challenges & Solutions",
    "projects_details_featuresTitle": "Key Features",
    "projects_details_challengesTitle": "Challenges",
    "projects_details_solutionsTitle": "Solutions",
    "projects_status_ongoing": "Ongoing",
    "projects_culturefit_role": "Backend Developer, Project Manager, Optimization Specialist",
    "projects_culturefit_longDescription": "This application was developed by a team of three, with each member focusing on different features. My primary contributions were backend development, task management, application optimization, and some frontend components. The platform is designed for gym management, offering key features such as subscriptions, online content, appointment scheduling, and more. Built with Spring Boot, React, MySQL, and Docker, the application is still under development but already has a substantial portion of its core functionality implemented.",
    "projects_culturefit_challenges": "Managing different subscription plans with restricted access, ensuring secure online content distribution, and synchronizing the appointment system with professional availability.",
    "projects_culturefit_solutions": "Implemented JWT-based access control for role-based restrictions, secured online content with streaming protection, and built an event-driven scheduling system to prevent double bookings.",
    "projects_culturefit_feature_1": "User authentication",
    "projects_culturefit_feature_2": "Subscription management",
    "projects_culturefit_feature_3": "Appointment scheduling",
    "projects_culturefit_feature_4": "Online content",
    "projects_culturefit_feature_5": "Roles",
    "projects_culturefit_features_count": 5,
    "projects_smartsphere_role": "Frontend Developer",
    "projects_smartsphere_longDescription": "This application was developed by Johan Fernando Aponte Valencia. It is an online store specializing in technology products, offering a complete shopping experience. The platform includes essential e-commerce functionalities such as product listing, shopping cart, secure checkout, and an admin dashboard for managing users and products. The application is built with React and Tailwind CSS and continues to be actively developed.",
    "projects_smartsphere_challenges": "Ensuring persistent cart functionality, and maintaining real-time inventory management.",
    "projects_smartsphere_solutions": "Implemented JSON-SERVER to persist cart data and developed a stock control system that locks items in the cart until checkout is completed.",
    "projects_smartsphere_feature_1": "User authentication",
    "projects_smartsphere_feature_2": "Product listing",
    "projects_smartsphere_feature_3": "Cart functionality",
    "projects_smartsphere_feature_4": "Secure checkout",
    "projects_smartsphere_feature_5": "Admin dashboard",
    "projects_smartsphere_features_count": 5,
    "projects_trivial_description": "A Python terminal-based trivia game with questions and answers, utilizing OOP concepts and JSON for data storage.",
    "projects_trivial_role": "Backend Developer",
    "projects_trivial_longDescription": "This project is a terminal-based trivia game developed in Python. It leverages Object-Oriented Programming (OOP) principles to manage game logic and uses JSON to store and retrieve questions and answers. The game provides an engaging way to test cultural knowledge with a variety of questions.",
    "projects_trivial_challenges": "Designing a flexible question storage system and ensuring smooth user interaction in a terminal-based environment.",
    "projects_trivial_solutions": "Implemented a JSON-based storage system for easy question management and used Python's OOP features to create a modular and maintainable codebase.",
    "projects_trivial_feature_1": "Question and answer functionality",
    "projects_trivial_feature_2": "Score tracking",
    "projects_trivial_feature_3": "JSON-based question storage",
    "projects_trivial_feature_4": "OOP design for scalability",
    "projects_trivial_features_count": 4,
    "projects_vue_role": "Full Stack Developer",
    "projects_vue_longDescription": "This project is a task manager application developed using Vue.js for the frontend and Express for the backend. It includes features such as user authentication, task creation, and a shopping cart. MongoDB is used for data storage, and Bootstrap is used for styling. The application demonstrates a full-stack implementation with a focus on usability and scalability.",
    "projects_vue_challenges": "Integrating state management with Pinia and ensuring seamless communication between the frontend and backend.",
    "projects_vue_solutions": "Used Pinia for efficient state management and implemented RESTful APIs with Express to handle backend operations.",
    "projects_vue_feature_1": "User authentication",
    "projects_vue_feature_2": "Task creation and management",
    "projects_vue_feature_3": "Shopping cart functionality",
    "projects_vue_feature_4": "Responsive design",
    "projects_vue_features_count": 4,
    "projects_dao_role": "Backend Developer",
    "projects_dao_longDescription": "This project is a database access application developed in Java. It allows users to interact with a database containing information about students and houses from the Harry Potter universe. The project demonstrates the use of Java for backend development and MySQL for database management.",
    "projects_dao_challenges": "Designing an efficient database schema and ensuring seamless interaction between the Java application and the MySQL database.",
    "projects_dao_solutions": "Implemented a normalized database schema and used JDBC for smooth communication between the application and the database.",
    "projects_dao_feature_1": "Database access",
    "projects_dao_feature_2": "CRUD operations",
    "projects_dao_feature_3": "Student and house management",
    "projects_dao_features_count": 3
}